Microchip-MPLAB-Harmony/touch_apps/apps/t10_mutualcap_xpro_board/pic32cm_pl10_cnano/firmware/src/packs/PIC32CM6408PL10048_DFP/component/ptc.h
/*
 * Component description for PTC
 *
 * Copyright (c) 2025 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/*      file generated from device description file (ATDF) version None       */
#ifndef _PIC32CMPL10_PTC_COMPONENT_H_
#define _PIC32CMPL10_PTC_COMPONENT_H_

#include "core_cm0plus.h"

/* ************************************************************************** */
/*                      SOFTWARE API DEFINITION FOR PTC                       */
/* ************************************************************************** */

/* -------- PTC_CTRLA : (PTC Offset: 0x00) (R/W 32) CTRLA -------- */
#define PTC_CTRLA_RESETVALUE                  _UINT32_(0x00)                                       /*  (PTC_CTRLA) CTRLA  Reset Value */

#define PTC_CTRLA_SWRST_Pos                   _UINT32_(0)                                          /* (PTC_CTRLA) Software reset Position */
#define PTC_CTRLA_SWRST_Msk                   (_UINT32_(0x1) << PTC_CTRLA_SWRST_Pos)               /* (PTC_CTRLA) Software reset Mask */
#define PTC_CTRLA_SWRST(value)                (PTC_CTRLA_SWRST_Msk & (_UINT32_(value) << PTC_CTRLA_SWRST_Pos)) /* Assignment of value for SWRST in the PTC_CTRLA register */
#define   PTC_CTRLA_SWRST_SWRST_REQ_Val       _UINT32_(0x1)                                        /* (PTC_CTRLA) Resets this module  */
#define PTC_CTRLA_SWRST_SWRST_REQ             (PTC_CTRLA_SWRST_SWRST_REQ_Val << PTC_CTRLA_SWRST_Pos) /* (PTC_CTRLA) Resets this module Position */
#define PTC_CTRLA_ENABLE_Pos                  _UINT32_(1)                                          /* (PTC_CTRLA) PTC Enable Position */
#define PTC_CTRLA_ENABLE_Msk                  (_UINT32_(0x1) << PTC_CTRLA_ENABLE_Pos)              /* (PTC_CTRLA) PTC Enable Mask */
#define PTC_CTRLA_ENABLE(value)               (PTC_CTRLA_ENABLE_Msk & (_UINT32_(value) << PTC_CTRLA_ENABLE_Pos)) /* Assignment of value for ENABLE in the PTC_CTRLA register */
#define   PTC_CTRLA_ENABLE_DISABLE_Val        _UINT32_(0x0)                                        /* (PTC_CTRLA) PTC is disabled  */
#define   PTC_CTRLA_ENABLE_ENABLE_Val         _UINT32_(0x1)                                        /* (PTC_CTRLA) PTC is enabled  */
#define PTC_CTRLA_ENABLE_DISABLE              (PTC_CTRLA_ENABLE_DISABLE_Val << PTC_CTRLA_ENABLE_Pos) /* (PTC_CTRLA) PTC is disabled Position */
#define PTC_CTRLA_ENABLE_ENABLE               (PTC_CTRLA_ENABLE_ENABLE_Val << PTC_CTRLA_ENABLE_Pos) /* (PTC_CTRLA) PTC is enabled Position */
#define PTC_CTRLA_Msk                         _UINT32_(0x00000003)                                 /* (PTC_CTRLA) Register Mask  */


/* -------- PTC_CTRLB : (PTC Offset: 0x04) (R/W 32) CTRLB -------- */
#define PTC_CTRLB_RESETVALUE                  _UINT32_(0x00)                                       /*  (PTC_CTRLB) CTRLB  Reset Value */

#define PTC_CTRLB_PRESC_Pos                   _UINT32_(0)                                          /* (PTC_CTRLB) Prescaler Position */
#define PTC_CTRLB_PRESC_Msk                   (_UINT32_(0xF) << PTC_CTRLB_PRESC_Pos)               /* (PTC_CTRLB) Prescaler Mask */
#define PTC_CTRLB_PRESC(value)                (PTC_CTRLB_PRESC_Msk & (_UINT32_(value) << PTC_CTRLB_PRESC_Pos)) /* Assignment of value for PRESC in the PTC_CTRLB register */
#define   PTC_CTRLB_PRESC_DIV1_Val            _UINT32_(0x0)                                        /* (PTC_CTRLB) PTC running on undivided peripheral clock  */
#define   PTC_CTRLB_PRESC_DIV2_Val            _UINT32_(0x1)                                        /* (PTC_CTRLB) Peripheral clock divided by 2  */
#define   PTC_CTRLB_PRESC_DIV4_Val            _UINT32_(0x2)                                        /* (PTC_CTRLB) Peripheral clock divided by 4  */
#define   PTC_CTRLB_PRESC_DIV6_Val            _UINT32_(0x3)                                        /* (PTC_CTRLB) Peripheral clock divided by 6  */
#define   PTC_CTRLB_PRESC_DIV8_Val            _UINT32_(0x4)                                        /* (PTC_CTRLB) Peripheral clock divided by 8  */
#define   PTC_CTRLB_PRESC_DIV10_Val           _UINT32_(0x5)                                        /* (PTC_CTRLB) Peripheral clock divided by 10  */
#define   PTC_CTRLB_PRESC_DIV12_Val           _UINT32_(0x6)                                        /* (PTC_CTRLB) Peripheral clock divided by 12  */
#define   PTC_CTRLB_PRESC_DIV14_Val           _UINT32_(0x7)                                        /* (PTC_CTRLB) Peripheral clock divided by 14  */
#define   PTC_CTRLB_PRESC_DIV16_Val           _UINT32_(0x8)                                        /* (PTC_CTRLB) Peripheral clock divided by 16  */
#define   PTC_CTRLB_PRESC_DIV18_Val           _UINT32_(0x9)                                        /* (PTC_CTRLB) Peripheral clock divided by 18  */
#define   PTC_CTRLB_PRESC_DIV20_Val           _UINT32_(0xA)                                        /* (PTC_CTRLB) Peripheral clock divided by 20  */
#define   PTC_CTRLB_PRESC_DIV22_Val           _UINT32_(0xB)                                        /* (PTC_CTRLB) Peripheral clock divided by 22  */
#define   PTC_CTRLB_PRESC_DIV24_Val           _UINT32_(0xC)                                        /* (PTC_CTRLB) Peripheral clock divided by 24  */
#define   PTC_CTRLB_PRESC_DIV26_Val           _UINT32_(0xD)                                        /* (PTC_CTRLB) Peripheral clock divided by 26  */
#define   PTC_CTRLB_PRESC_DIV28_Val           _UINT32_(0xE)                                        /* (PTC_CTRLB) Peripheral clock divided by 28  */
#define   PTC_CTRLB_PRESC_DIV30_Val           _UINT32_(0xF)                                        /* (PTC_CTRLB) Peripheral clock divided by 30  */
#define PTC_CTRLB_PRESC_DIV1                  (PTC_CTRLB_PRESC_DIV1_Val << PTC_CTRLB_PRESC_Pos)    /* (PTC_CTRLB) PTC running on undivided peripheral clock Position */
#define PTC_CTRLB_PRESC_DIV2                  (PTC_CTRLB_PRESC_DIV2_Val << PTC_CTRLB_PRESC_Pos)    /* (PTC_CTRLB) Peripheral clock divided by 2 Position */
#define PTC_CTRLB_PRESC_DIV4                  (PTC_CTRLB_PRESC_DIV4_Val << PTC_CTRLB_PRESC_Pos)    /* (PTC_CTRLB) Peripheral clock divided by 4 Position */
#define PTC_CTRLB_PRESC_DIV6                  (PTC_CTRLB_PRESC_DIV6_Val << PTC_CTRLB_PRESC_Pos)    /* (PTC_CTRLB) Peripheral clock divided by 6 Position */
#define PTC_CTRLB_PRESC_DIV8                  (PTC_CTRLB_PRESC_DIV8_Val << PTC_CTRLB_PRESC_Pos)    /* (PTC_CTRLB) Peripheral clock divided by 8 Position */
#define PTC_CTRLB_PRESC_DIV10                 (PTC_CTRLB_PRESC_DIV10_Val << PTC_CTRLB_PRESC_Pos)   /* (PTC_CTRLB) Peripheral clock divided by 10 Position */
#define PTC_CTRLB_PRESC_DIV12                 (PTC_CTRLB_PRESC_DIV12_Val << PTC_CTRLB_PRESC_Pos)   /* (PTC_CTRLB) Peripheral clock divided by 12 Position */
#define PTC_CTRLB_PRESC_DIV14                 (PTC_CTRLB_PRESC_DIV14_Val << PTC_CTRLB_PRESC_Pos)   /* (PTC_CTRLB) Peripheral clock divided by 14 Position */
#define PTC_CTRLB_PRESC_DIV16                 (PTC_CTRLB_PRESC_DIV16_Val << PTC_CTRLB_PRESC_Pos)   /* (PTC_CTRLB) Peripheral clock divided by 16 Position */
#define PTC_CTRLB_PRESC_DIV18                 (PTC_CTRLB_PRESC_DIV18_Val << PTC_CTRLB_PRESC_Pos)   /* (PTC_CTRLB) Peripheral clock divided by 18 Position */
#define PTC_CTRLB_PRESC_DIV20                 (PTC_CTRLB_PRESC_DIV20_Val << PTC_CTRLB_PRESC_Pos)   /* (PTC_CTRLB) Peripheral clock divided by 20 Position */
#define PTC_CTRLB_PRESC_DIV22                 (PTC_CTRLB_PRESC_DIV22_Val << PTC_CTRLB_PRESC_Pos)   /* (PTC_CTRLB) Peripheral clock divided by 22 Position */
#define PTC_CTRLB_PRESC_DIV24                 (PTC_CTRLB_PRESC_DIV24_Val << PTC_CTRLB_PRESC_Pos)   /* (PTC_CTRLB) Peripheral clock divided by 24 Position */
#define PTC_CTRLB_PRESC_DIV26                 (PTC_CTRLB_PRESC_DIV26_Val << PTC_CTRLB_PRESC_Pos)   /* (PTC_CTRLB) Peripheral clock divided by 26 Position */
#define PTC_CTRLB_PRESC_DIV28                 (PTC_CTRLB_PRESC_DIV28_Val << PTC_CTRLB_PRESC_Pos)   /* (PTC_CTRLB) Peripheral clock divided by 28 Position */
#define PTC_CTRLB_PRESC_DIV30                 (PTC_CTRLB_PRESC_DIV30_Val << PTC_CTRLB_PRESC_Pos)   /* (PTC_CTRLB) Peripheral clock divided by 30 Position */
#define PTC_CTRLB_RSTSETTLE_Pos               _UINT32_(8)                                          /* (PTC_CTRLB) Reset Settling Time Position */
#define PTC_CTRLB_RSTSETTLE_Msk               (_UINT32_(0x3F) << PTC_CTRLB_RSTSETTLE_Pos)          /* (PTC_CTRLB) Reset Settling Time Mask */
#define PTC_CTRLB_RSTSETTLE(value)            (PTC_CTRLB_RSTSETTLE_Msk & (_UINT32_(value) << PTC_CTRLB_RSTSETTLE_Pos)) /* Assignment of value for RSTSETTLE in the PTC_CTRLB register */
#define PTC_CTRLB_Msk                         _UINT32_(0x00003F0F)                                 /* (PTC_CTRLB) Register Mask  */


