Microchip-MPLAB-Harmony/touch_apps/apps/t10_mutualcap_xpro_board/pic32cm_pl10_cnano/firmware/src/packs/PIC32CM6408PL10048_DFP/component/ptc.h
/* -------- PTC_CTRLC : (PTC Offset: 0x08) (R/W 32) CTRLC -------- */
#define PTC_CTRLC_RESETVALUE                  _UINT32_(0x00)                                       /*  (PTC_CTRLC) CTRLC  Reset Value */

#define PTC_CTRLC_CTSM_Pos                    _UINT32_(0)                                          /* (PTC_CTRLC) Capacitive Touch Sensing Mode Position */
#define PTC_CTRLC_CTSM_Msk                    (_UINT32_(0x3) << PTC_CTRLC_CTSM_Pos)                /* (PTC_CTRLC) Capacitive Touch Sensing Mode Mask */
#define PTC_CTRLC_CTSM(value)                 (PTC_CTRLC_CTSM_Msk & (_UINT32_(value) << PTC_CTRLC_CTSM_Pos)) /* Assignment of value for CTSM in the PTC_CTRLC register */
#define   PTC_CTRLC_CTSM_MC_Val               _UINT32_(0x0)                                        /* (PTC_CTRLC) Mutual Capacitance sensing  */
#define   PTC_CTRLC_CTSM_SC4_Val              _UINT32_(0x1)                                        /* (PTC_CTRLC) Self-capacitance sensing, 4 Phase. Balancing phase skipped  */
#define   PTC_CTRLC_CTSM_SC6_Val              _UINT32_(0x2)                                        /* (PTC_CTRLC) Self-capacitance sensing, 6 Phase  */
#define PTC_CTRLC_CTSM_MC                     (PTC_CTRLC_CTSM_MC_Val << PTC_CTRLC_CTSM_Pos)        /* (PTC_CTRLC) Mutual Capacitance sensing Position */
#define PTC_CTRLC_CTSM_SC4                    (PTC_CTRLC_CTSM_SC4_Val << PTC_CTRLC_CTSM_Pos)       /* (PTC_CTRLC) Self-capacitance sensing, 4 Phase. Balancing phase skipped Position */
#define PTC_CTRLC_CTSM_SC6                    (PTC_CTRLC_CTSM_SC6_Val << PTC_CTRLC_CTSM_Pos)       /* (PTC_CTRLC) Self-capacitance sensing, 6 Phase Position */
#define PTC_CTRLC_INTEGRATION_Pos             _UINT32_(4)                                          /* (PTC_CTRLC) Integration Mode Position */
#define PTC_CTRLC_INTEGRATION_Msk             (_UINT32_(0x3) << PTC_CTRLC_INTEGRATION_Pos)         /* (PTC_CTRLC) Integration Mode Mask */
#define PTC_CTRLC_INTEGRATION(value)          (PTC_CTRLC_INTEGRATION_Msk & (_UINT32_(value) << PTC_CTRLC_INTEGRATION_Pos)) /* Assignment of value for INTEGRATION in the PTC_CTRLC register */
#define   PTC_CTRLC_INTEGRATION_DIFF_Val      _UINT32_(0x0)                                        /* (PTC_CTRLC) Differential Integration  */
#define   PTC_CTRLC_INTEGRATION_SINGLE_Val    _UINT32_(0x1)                                        /* (PTC_CTRLC) Single ended integration  */
#define   PTC_CTRLC_INTEGRATION_DUAL_Val      _UINT32_(0x2)                                        /* (PTC_CTRLC) Dual Integration. ADC conversion after each polarity phase  */
#define PTC_CTRLC_INTEGRATION_DIFF            (PTC_CTRLC_INTEGRATION_DIFF_Val << PTC_CTRLC_INTEGRATION_Pos) /* (PTC_CTRLC) Differential Integration Position */
#define PTC_CTRLC_INTEGRATION_SINGLE          (PTC_CTRLC_INTEGRATION_SINGLE_Val << PTC_CTRLC_INTEGRATION_Pos) /* (PTC_CTRLC) Single ended integration Position */
#define PTC_CTRLC_INTEGRATION_DUAL            (PTC_CTRLC_INTEGRATION_DUAL_Val << PTC_CTRLC_INTEGRATION_Pos) /* (PTC_CTRLC) Dual Integration. ADC conversion after each polarity phase Position */
#define PTC_CTRLC_RESPOL_Pos                  _UINT32_(6)                                          /* (PTC_CTRLC) Result Polarity Position */
#define PTC_CTRLC_RESPOL_Msk                  (_UINT32_(0x1) << PTC_CTRLC_RESPOL_Pos)              /* (PTC_CTRLC) Result Polarity Mask */
#define PTC_CTRLC_RESPOL(value)               (PTC_CTRLC_RESPOL_Msk & (_UINT32_(value) << PTC_CTRLC_RESPOL_Pos)) /* Assignment of value for RESPOL in the PTC_CTRLC register */
#define   PTC_CTRLC_RESPOL_NORMAL_Val         _UINT32_(0x0)                                        /* (PTC_CTRLC) ADC is told to invert result when sampling PTC output in phase A  */
#define   PTC_CTRLC_RESPOL_INVERTED_Val       _UINT32_(0x1)                                        /* (PTC_CTRLC) ADC is told to invert result when sampling PTC output in phase B  */
#define PTC_CTRLC_RESPOL_NORMAL               (PTC_CTRLC_RESPOL_NORMAL_Val << PTC_CTRLC_RESPOL_Pos) /* (PTC_CTRLC) ADC is told to invert result when sampling PTC output in phase A Position */
#define PTC_CTRLC_RESPOL_INVERTED             (PTC_CTRLC_RESPOL_INVERTED_Val << PTC_CTRLC_RESPOL_Pos) /* (PTC_CTRLC) ADC is told to invert result when sampling PTC output in phase B Position */
#define PTC_CTRLC_VREFSEL_Pos                 _UINT32_(8)                                          /* (PTC_CTRLC) Reference select Position */
#define PTC_CTRLC_VREFSEL_Msk                 (_UINT32_(0x3) << PTC_CTRLC_VREFSEL_Pos)             /* (PTC_CTRLC) Reference select Mask */
#define PTC_CTRLC_VREFSEL(value)              (PTC_CTRLC_VREFSEL_Msk & (_UINT32_(value) << PTC_CTRLC_VREFSEL_Pos)) /* Assignment of value for VREFSEL in the PTC_CTRLC register */
#define   PTC_CTRLC_VREFSEL_VDD50_Val         _UINT32_(0x0)                                        /* (PTC_CTRLC) VDD*1/2  */
#define   PTC_CTRLC_VREFSEL_RES_Val           _UINT32_(0x1)                                        /* (PTC_CTRLC) Reserved (VDD50 selected))  */
#define   PTC_CTRLC_VREFSEL_VDD25_Val         _UINT32_(0x2)                                        /* (PTC_CTRLC) VDD*1/4  */
#define   PTC_CTRLC_VREFSEL_VDD75_Val         _UINT32_(0x3)                                        /* (PTC_CTRLC) VDD*3/4  */
#define PTC_CTRLC_VREFSEL_VDD50               (PTC_CTRLC_VREFSEL_VDD50_Val << PTC_CTRLC_VREFSEL_Pos) /* (PTC_CTRLC) VDD*1/2 Position */
#define PTC_CTRLC_VREFSEL_RES                 (PTC_CTRLC_VREFSEL_RES_Val << PTC_CTRLC_VREFSEL_Pos) /* (PTC_CTRLC) Reserved (VDD50 selected)) Position */
#define PTC_CTRLC_VREFSEL_VDD25               (PTC_CTRLC_VREFSEL_VDD25_Val << PTC_CTRLC_VREFSEL_Pos) /* (PTC_CTRLC) VDD*1/4 Position */
#define PTC_CTRLC_VREFSEL_VDD75               (PTC_CTRLC_VREFSEL_VDD75_Val << PTC_CTRLC_VREFSEL_Pos) /* (PTC_CTRLC) VDD*3/4 Position */
#define PTC_CTRLC_SENSORSEL_Pos               _UINT32_(10)                                         /* (PTC_CTRLC) Sensor Select Position */
#define PTC_CTRLC_SENSORSEL_Msk               (_UINT32_(0x1) << PTC_CTRLC_SENSORSEL_Pos)           /* (PTC_CTRLC) Sensor Select Mask */
#define PTC_CTRLC_SENSORSEL(value)            (PTC_CTRLC_SENSORSEL_Msk & (_UINT32_(value) << PTC_CTRLC_SENSORSEL_Pos)) /* Assignment of value for SENSORSEL in the PTC_CTRLC register */
#define   PTC_CTRLC_SENSORSEL_CONNECT_Val     _UINT32_(0x0)                                        /* (PTC_CTRLC) Connect sensor during integration  */
#define   PTC_CTRLC_SENSORSEL_DISCONNECT_Val  _UINT32_(0x1)                                        /* (PTC_CTRLC) Disconnect sensor during integration  */
#define PTC_CTRLC_SENSORSEL_CONNECT           (PTC_CTRLC_SENSORSEL_CONNECT_Val << PTC_CTRLC_SENSORSEL_Pos) /* (PTC_CTRLC) Connect sensor during integration Position */
#define PTC_CTRLC_SENSORSEL_DISCONNECT        (PTC_CTRLC_SENSORSEL_DISCONNECT_Val << PTC_CTRLC_SENSORSEL_Pos) /* (PTC_CTRLC) Disconnect sensor during integration Position */
#define PTC_CTRLC_INTGRSEL_Pos                _UINT32_(11)                                         /* (PTC_CTRLC) Integrator Select Position */
#define PTC_CTRLC_INTGRSEL_Msk                (_UINT32_(0x1) << PTC_CTRLC_INTGRSEL_Pos)            /* (PTC_CTRLC) Integrator Select Mask */
#define PTC_CTRLC_INTGRSEL(value)             (PTC_CTRLC_INTGRSEL_Msk & (_UINT32_(value) << PTC_CTRLC_INTGRSEL_Pos)) /* Assignment of value for INTGRSEL in the PTC_CTRLC register */
#define   PTC_CTRLC_INTGRSEL_CONNECT_Val      _UINT32_(0x0)                                        /* (PTC_CTRLC) Connect integrator during charge distribution  */
#define   PTC_CTRLC_INTGRSEL_DISCONNECT_Val   _UINT32_(0x1)                                        /* (PTC_CTRLC) Disconnect integrator during charge distribution  */
#define PTC_CTRLC_INTGRSEL_CONNECT            (PTC_CTRLC_INTGRSEL_CONNECT_Val << PTC_CTRLC_INTGRSEL_Pos) /* (PTC_CTRLC) Connect integrator during charge distribution Position */
#define PTC_CTRLC_INTGRSEL_DISCONNECT         (PTC_CTRLC_INTGRSEL_DISCONNECT_Val << PTC_CTRLC_INTGRSEL_Pos) /* (PTC_CTRLC) Disconnect integrator during charge distribution Position */
#define PTC_CTRLC_PASSIVE_Pos                 _UINT32_(15)                                         /* (PTC_CTRLC) Passive Mode Position */
#define PTC_CTRLC_PASSIVE_Msk                 (_UINT32_(0x1) << PTC_CTRLC_PASSIVE_Pos)             /* (PTC_CTRLC) Passive Mode Mask */
#define PTC_CTRLC_PASSIVE(value)              (PTC_CTRLC_PASSIVE_Msk & (_UINT32_(value) << PTC_CTRLC_PASSIVE_Pos)) /* Assignment of value for PASSIVE in the PTC_CTRLC register */
#define   PTC_CTRLC_PASSIVE_OFF_Val           _UINT32_(0x0)                                        /* (PTC_CTRLC) Passive disabled. Drivers enabled  */
#define   PTC_CTRLC_PASSIVE_ON_Val            _UINT32_(0x1)                                        /* (PTC_CTRLC) Passive mode enabled. Drivers disabled  */
#define PTC_CTRLC_PASSIVE_OFF                 (PTC_CTRLC_PASSIVE_OFF_Val << PTC_CTRLC_PASSIVE_Pos) /* (PTC_CTRLC) Passive disabled. Drivers enabled Position */
#define PTC_CTRLC_PASSIVE_ON                  (PTC_CTRLC_PASSIVE_ON_Val << PTC_CTRLC_PASSIVE_Pos)  /* (PTC_CTRLC) Passive mode enabled. Drivers disabled Position */
#define PTC_CTRLC_ITSPULSE_Pos                _UINT32_(16)                                         /* (PTC_CTRLC) ITS Pulse Length Position */
#define PTC_CTRLC_ITSPULSE_Msk                (_UINT32_(0x1F) << PTC_CTRLC_ITSPULSE_Pos)           /* (PTC_CTRLC) ITS Pulse Length Mask */
#define PTC_CTRLC_ITSPULSE(value)             (PTC_CTRLC_ITSPULSE_Msk & (_UINT32_(value) << PTC_CTRLC_ITSPULSE_Pos)) /* Assignment of value for ITSPULSE in the PTC_CTRLC register */
#define   PTC_CTRLC_ITSPULSE_CLK1_Val         _UINT32_(0x0)                                        /* (PTC_CTRLC) 1 Clock Period  */
#define   PTC_CTRLC_ITSPULSE_CLK1P5_Val       _UINT32_(0x1)                                        /* (PTC_CTRLC) 1.5 Clock Periods  */
#define   PTC_CTRLC_ITSPULSE_CLK2_Val         _UINT32_(0x2)                                        /* (PTC_CTRLC) 2 Clock Period  */
#define   PTC_CTRLC_ITSPULSE_CLK2P5_Val       _UINT32_(0x3)                                        /* (PTC_CTRLC) 2.5 Clock Periods  */
#define   PTC_CTRLC_ITSPULSE_CLK3_Val         _UINT32_(0x4)                                        /* (PTC_CTRLC) 3 Clock Period  */
#define   PTC_CTRLC_ITSPULSE_CLK3P5_Val       _UINT32_(0x5)                                        /* (PTC_CTRLC) 3.5 Clock Periods  */
#define   PTC_CTRLC_ITSPULSE_CLK4_Val         _UINT32_(0x6)                                        /* (PTC_CTRLC) 4 Clock Period  */
#define   PTC_CTRLC_ITSPULSE_CLK4P5_Val       _UINT32_(0x7)                                        /* (PTC_CTRLC) 4.5 Clock Periods  */
#define   PTC_CTRLC_ITSPULSE_CLK5_Val         _UINT32_(0x8)                                        /* (PTC_CTRLC) 5 Clock Period  */
#define   PTC_CTRLC_ITSPULSE_CLK5P5_Val       _UINT32_(0x9)                                        /* (PTC_CTRLC) 5.5 Clock Periods  */
#define   PTC_CTRLC_ITSPULSE_CLK6_Val         _UINT32_(0xA)                                        /* (PTC_CTRLC) 6 Clock Period  */
#define   PTC_CTRLC_ITSPULSE_CLK6P5_Val       _UINT32_(0xB)                                        /* (PTC_CTRLC) 6.5 Clock Periods  */
#define   PTC_CTRLC_ITSPULSE_CLK7_Val         _UINT32_(0xC)                                        /* (PTC_CTRLC) 7 Clock Period  */
#define   PTC_CTRLC_ITSPULSE_CLK7P5_Val       _UINT32_(0xD)                                        /* (PTC_CTRLC) 7.5 Clock Periods  */
#define   PTC_CTRLC_ITSPULSE_CLK8_Val         _UINT32_(0xE)                                        /* (PTC_CTRLC) 8 Clock Period  */
#define   PTC_CTRLC_ITSPULSE_CLK8P5_Val       _UINT32_(0xF)                                        /* (PTC_CTRLC) 8.5 Clock Periods  */
#define   PTC_CTRLC_ITSPULSE_CLK9_Val         _UINT32_(0x10)                                       /* (PTC_CTRLC) 9 Clock Period  */
#define   PTC_CTRLC_ITSPULSE_CLK9P5_Val       _UINT32_(0x11)                                       /* (PTC_CTRLC) 9.5 Clock Periods  */
#define   PTC_CTRLC_ITSPULSE_CLK10_Val        _UINT32_(0x12)                                       /* (PTC_CTRLC) 10 Clock Period  */
#define   PTC_CTRLC_ITSPULSE_CLK10P5_Val      _UINT32_(0x13)                                       /* (PTC_CTRLC) 10.5 Clock Periods  */
#define   PTC_CTRLC_ITSPULSE_CLK11_Val        _UINT32_(0x14)                                       /* (PTC_CTRLC) 11 Clock Period  */
#define   PTC_CTRLC_ITSPULSE_CLK11P5_Val      _UINT32_(0x15)                                       /* (PTC_CTRLC) 11.5 Clock Periods  */
#define   PTC_CTRLC_ITSPULSE_CLK12_Val        _UINT32_(0x16)                                       /* (PTC_CTRLC) 12 Clock Period  */
#define   PTC_CTRLC_ITSPULSE_CLK12P5_Val      _UINT32_(0x17)                                       /* (PTC_CTRLC) 12.5 Clock Periods  */
#define   PTC_CTRLC_ITSPULSE_CLK13_Val        _UINT32_(0x18)                                       /* (PTC_CTRLC) 13 Clock Period  */
#define   PTC_CTRLC_ITSPULSE_CLK13P5_Val      _UINT32_(0x19)                                       /* (PTC_CTRLC) 13.5 Clock Periods  */
#define   PTC_CTRLC_ITSPULSE_CLK14_Val        _UINT32_(0x1A)                                       /* (PTC_CTRLC) 14 Clock Period  */
#define   PTC_CTRLC_ITSPULSE_CLK14P5_Val      _UINT32_(0x1B)                                       /* (PTC_CTRLC) 14.5 Clock Periods  */
#define   PTC_CTRLC_ITSPULSE_CLK15_Val        _UINT32_(0x1C)                                       /* (PTC_CTRLC) 15 Clock Period  */
#define   PTC_CTRLC_ITSPULSE_CLK15P5_Val      _UINT32_(0x1D)                                       /* (PTC_CTRLC) 15.5 Clock Periods  */
#define   PTC_CTRLC_ITSPULSE_CLK16_Val        _UINT32_(0x1E)                                       /* (PTC_CTRLC) 16 Clock Period  */
#define   PTC_CTRLC_ITSPULSE_CLK16P5_Val      _UINT32_(0x1F)                                       /* (PTC_CTRLC) 16.5 Clock Periods  */
#define PTC_CTRLC_ITSPULSE_CLK1               (PTC_CTRLC_ITSPULSE_CLK1_Val << PTC_CTRLC_ITSPULSE_Pos) /* (PTC_CTRLC) 1 Clock Period Position */
#define PTC_CTRLC_ITSPULSE_CLK1P5             (PTC_CTRLC_ITSPULSE_CLK1P5_Val << PTC_CTRLC_ITSPULSE_Pos) /* (PTC_CTRLC) 1.5 Clock Periods Position */
#define PTC_CTRLC_ITSPULSE_CLK2               (PTC_CTRLC_ITSPULSE_CLK2_Val << PTC_CTRLC_ITSPULSE_Pos) /* (PTC_CTRLC) 2 Clock Period Position */
#define PTC_CTRLC_ITSPULSE_CLK2P5             (PTC_CTRLC_ITSPULSE_CLK2P5_Val << PTC_CTRLC_ITSPULSE_Pos) /* (PTC_CTRLC) 2.5 Clock Periods Position */
#define PTC_CTRLC_ITSPULSE_CLK3               (PTC_CTRLC_ITSPULSE_CLK3_Val << PTC_CTRLC_ITSPULSE_Pos) /* (PTC_CTRLC) 3 Clock Period Position */
#define PTC_CTRLC_ITSPULSE_CLK3P5             (PTC_CTRLC_ITSPULSE_CLK3P5_Val << PTC_CTRLC_ITSPULSE_Pos) /* (PTC_CTRLC) 3.5 Clock Periods Position */
#define PTC_CTRLC_ITSPULSE_CLK4               (PTC_CTRLC_ITSPULSE_CLK4_Val << PTC_CTRLC_ITSPULSE_Pos) /* (PTC_CTRLC) 4 Clock Period Position */
#define PTC_CTRLC_ITSPULSE_CLK4P5             (PTC_CTRLC_ITSPULSE_CLK4P5_Val << PTC_CTRLC_ITSPULSE_Pos) /* (PTC_CTRLC) 4.5 Clock Periods Position */
#define PTC_CTRLC_ITSPULSE_CLK5               (PTC_CTRLC_ITSPULSE_CLK5_Val << PTC_CTRLC_ITSPULSE_Pos) /* (PTC_CTRLC) 5 Clock Period Position */
#define PTC_CTRLC_ITSPULSE_CLK5P5             (PTC_CTRLC_ITSPULSE_CLK5P5_Val << PTC_CTRLC_ITSPULSE_Pos) /* (PTC_CTRLC) 5.5 Clock Periods Position */
#define PTC_CTRLC_ITSPULSE_CLK6               (PTC_CTRLC_ITSPULSE_CLK6_Val << PTC_CTRLC_ITSPULSE_Pos) /* (PTC_CTRLC) 6 Clock Period Position */
#define PTC_CTRLC_ITSPULSE_CLK6P5             (PTC_CTRLC_ITSPULSE_CLK6P5_Val << PTC_CTRLC_ITSPULSE_Pos) /* (PTC_CTRLC) 6.5 Clock Periods Position */
#define PTC_CTRLC_ITSPULSE_CLK7               (PTC_CTRLC_ITSPULSE_CLK7_Val << PTC_CTRLC_ITSPULSE_Pos) /* (PTC_CTRLC) 7 Clock Period Position */
#define PTC_CTRLC_ITSPULSE_CLK7P5             (PTC_CTRLC_ITSPULSE_CLK7P5_Val << PTC_CTRLC_ITSPULSE_Pos) /* (PTC_CTRLC) 7.5 Clock Periods Position */
#define PTC_CTRLC_ITSPULSE_CLK8               (PTC_CTRLC_ITSPULSE_CLK8_Val << PTC_CTRLC_ITSPULSE_Pos) /* (PTC_CTRLC) 8 Clock Period Position */
#define PTC_CTRLC_ITSPULSE_CLK8P5             (PTC_CTRLC_ITSPULSE_CLK8P5_Val << PTC_CTRLC_ITSPULSE_Pos) /* (PTC_CTRLC) 8.5 Clock Periods Position */
#define PTC_CTRLC_ITSPULSE_CLK9               (PTC_CTRLC_ITSPULSE_CLK9_Val << PTC_CTRLC_ITSPULSE_Pos) /* (PTC_CTRLC) 9 Clock Period Position */
#define PTC_CTRLC_ITSPULSE_CLK9P5             (PTC_CTRLC_ITSPULSE_CLK9P5_Val << PTC_CTRLC_ITSPULSE_Pos) /* (PTC_CTRLC) 9.5 Clock Periods Position */
#define PTC_CTRLC_ITSPULSE_CLK10              (PTC_CTRLC_ITSPULSE_CLK10_Val << PTC_CTRLC_ITSPULSE_Pos) /* (PTC_CTRLC) 10 Clock Period Position */
#define PTC_CTRLC_ITSPULSE_CLK10P5            (PTC_CTRLC_ITSPULSE_CLK10P5_Val << PTC_CTRLC_ITSPULSE_Pos) /* (PTC_CTRLC) 10.5 Clock Periods Position */
#define PTC_CTRLC_ITSPULSE_CLK11              (PTC_CTRLC_ITSPULSE_CLK11_Val << PTC_CTRLC_ITSPULSE_Pos) /* (PTC_CTRLC) 11 Clock Period Position */
#define PTC_CTRLC_ITSPULSE_CLK11P5            (PTC_CTRLC_ITSPULSE_CLK11P5_Val << PTC_CTRLC_ITSPULSE_Pos) /* (PTC_CTRLC) 11.5 Clock Periods Position */
#define PTC_CTRLC_ITSPULSE_CLK12              (PTC_CTRLC_ITSPULSE_CLK12_Val << PTC_CTRLC_ITSPULSE_Pos) /* (PTC_CTRLC) 12 Clock Period Position */
#define PTC_CTRLC_ITSPULSE_CLK12P5            (PTC_CTRLC_ITSPULSE_CLK12P5_Val << PTC_CTRLC_ITSPULSE_Pos) /* (PTC_CTRLC) 12.5 Clock Periods Position */
#define PTC_CTRLC_ITSPULSE_CLK13              (PTC_CTRLC_ITSPULSE_CLK13_Val << PTC_CTRLC_ITSPULSE_Pos) /* (PTC_CTRLC) 13 Clock Period Position */
#define PTC_CTRLC_ITSPULSE_CLK13P5            (PTC_CTRLC_ITSPULSE_CLK13P5_Val << PTC_CTRLC_ITSPULSE_Pos) /* (PTC_CTRLC) 13.5 Clock Periods Position */
#define PTC_CTRLC_ITSPULSE_CLK14              (PTC_CTRLC_ITSPULSE_CLK14_Val << PTC_CTRLC_ITSPULSE_Pos) /* (PTC_CTRLC) 14 Clock Period Position */
#define PTC_CTRLC_ITSPULSE_CLK14P5            (PTC_CTRLC_ITSPULSE_CLK14P5_Val << PTC_CTRLC_ITSPULSE_Pos) /* (PTC_CTRLC) 14.5 Clock Periods Position */
#define PTC_CTRLC_ITSPULSE_CLK15              (PTC_CTRLC_ITSPULSE_CLK15_Val << PTC_CTRLC_ITSPULSE_Pos) /* (PTC_CTRLC) 15 Clock Period Position */
#define PTC_CTRLC_ITSPULSE_CLK15P5            (PTC_CTRLC_ITSPULSE_CLK15P5_Val << PTC_CTRLC_ITSPULSE_Pos) /* (PTC_CTRLC) 15.5 Clock Periods Position */
#define PTC_CTRLC_ITSPULSE_CLK16              (PTC_CTRLC_ITSPULSE_CLK16_Val << PTC_CTRLC_ITSPULSE_Pos) /* (PTC_CTRLC) 16 Clock Period Position */
#define PTC_CTRLC_ITSPULSE_CLK16P5            (PTC_CTRLC_ITSPULSE_CLK16P5_Val << PTC_CTRLC_ITSPULSE_Pos) /* (PTC_CTRLC) 16.5 Clock Periods Position */
#define PTC_CTRLC_ITSEN_Pos                   _UINT32_(22)                                         /* (PTC_CTRLC) Impulse Touch Sensing Enable Position */
#define PTC_CTRLC_ITSEN_Msk                   (_UINT32_(0x1) << PTC_CTRLC_ITSEN_Pos)               /* (PTC_CTRLC) Impulse Touch Sensing Enable Mask */
#define PTC_CTRLC_ITSEN(value)                (PTC_CTRLC_ITSEN_Msk & (_UINT32_(value) << PTC_CTRLC_ITSEN_Pos)) /* Assignment of value for ITSEN in the PTC_CTRLC register */
#define   PTC_CTRLC_ITSEN_OFF_Val             _UINT32_(0x0)                                        /* (PTC_CTRLC) ITS disabled  */
#define   PTC_CTRLC_ITSEN_SYNC_Val            _UINT32_(0x1)                                        /* (PTC_CTRLC) Synchronous ITS  */
#define PTC_CTRLC_ITSEN_OFF                   (PTC_CTRLC_ITSEN_OFF_Val << PTC_CTRLC_ITSEN_Pos)     /* (PTC_CTRLC) ITS disabled Position */
#define PTC_CTRLC_ITSEN_SYNC                  (PTC_CTRLC_ITSEN_SYNC_Val << PTC_CTRLC_ITSEN_Pos)    /* (PTC_CTRLC) Synchronous ITS Position */
#define PTC_CTRLC_ANAACC_Pos                  _UINT32_(24)                                         /* (PTC_CTRLC) Analog Accumulation Position */
#define PTC_CTRLC_ANAACC_Msk                  (_UINT32_(0xFF) << PTC_CTRLC_ANAACC_Pos)             /* (PTC_CTRLC) Analog Accumulation Mask */
#define PTC_CTRLC_ANAACC(value)               (PTC_CTRLC_ANAACC_Msk & (_UINT32_(value) << PTC_CTRLC_ANAACC_Pos)) /* Assignment of value for ANAACC in the PTC_CTRLC register */
#define PTC_CTRLC_Msk                         _UINT32_(0xFF5F8F73)                                 /* (PTC_CTRLC) Register Mask  */


