Microchip-MPLAB-Harmony/touch_apps/apps/t10_mutualcap_xpro_board/pic32cm_pl10_cnano/firmware/src/packs/PIC32CM6408PL10048_DFP/component/ptc.h
/* -------- PTC_CTRLD : (PTC Offset: 0x0C) (R/W 32) CTRLD -------- */
#define PTC_CTRLD_RESETVALUE                  _UINT32_(0x00)                                       /*  (PTC_CTRLD) CTRLD  Reset Value */

#define PTC_CTRLD_SAMPDLY_Pos                 _UINT32_(0)                                          /* (PTC_CTRLD) Sampling Delay Selection Position */
#define PTC_CTRLD_SAMPDLY_Msk                 (_UINT32_(0xF) << PTC_CTRLD_SAMPDLY_Pos)             /* (PTC_CTRLD) Sampling Delay Selection Mask */
#define PTC_CTRLD_SAMPDLY(value)              (PTC_CTRLD_SAMPDLY_Msk & (_UINT32_(value) << PTC_CTRLD_SAMPDLY_Pos)) /* Assignment of value for SAMPDLY in the PTC_CTRLD register */
#define   PTC_CTRLD_SAMPDLY_OFF_Val           _UINT32_(0x0)                                        /* (PTC_CTRLD) No sampling delay  */
#define   PTC_CTRLD_SAMPDLY_DLY1_Val          _UINT32_(0x1)                                        /* (PTC_CTRLD) 1 PTC clock cycle sampling delay  */
#define   PTC_CTRLD_SAMPDLY_DLY2_Val          _UINT32_(0x2)                                        /* (PTC_CTRLD) 2 PTC clock cycle sampling delay  */
#define   PTC_CTRLD_SAMPDLY_DLY3_Val          _UINT32_(0x3)                                        /* (PTC_CTRLD) 3 PTC clock cycle sampling delay  */
#define   PTC_CTRLD_SAMPDLY_DLY4_Val          _UINT32_(0x4)                                        /* (PTC_CTRLD) 4 PTC clock cycle sampling delay  */
#define   PTC_CTRLD_SAMPDLY_DLY5_Val          _UINT32_(0x5)                                        /* (PTC_CTRLD) 5 PTC clock cycle sampling delay  */
#define   PTC_CTRLD_SAMPDLY_DLY6_Val          _UINT32_(0x6)                                        /* (PTC_CTRLD) 6 PTC clock cycle sampling delay  */
#define   PTC_CTRLD_SAMPDLY_DLY7_Val          _UINT32_(0x7)                                        /* (PTC_CTRLD) 7 PTC clock cycle sampling delay  */
#define   PTC_CTRLD_SAMPDLY_DLY8_Val          _UINT32_(0x8)                                        /* (PTC_CTRLD) 8 PTC clock cycle sampling delay  */
#define   PTC_CTRLD_SAMPDLY_DLY9_Val          _UINT32_(0x9)                                        /* (PTC_CTRLD) 9 PTC clock cycle sampling delay  */
#define   PTC_CTRLD_SAMPDLY_DLY10_Val         _UINT32_(0xA)                                        /* (PTC_CTRLD) 10 PTC clock cycle sampling delay  */
#define   PTC_CTRLD_SAMPDLY_DLY11_Val         _UINT32_(0xB)                                        /* (PTC_CTRLD) 11 PTC clock cycle sampling delay  */
#define   PTC_CTRLD_SAMPDLY_DLY12_Val         _UINT32_(0xC)                                        /* (PTC_CTRLD) 12 PTC clock cycle sampling delay  */
#define   PTC_CTRLD_SAMPDLY_DLY13_Val         _UINT32_(0xD)                                        /* (PTC_CTRLD) 13 PTC clock cycle sampling delay  */
#define   PTC_CTRLD_SAMPDLY_DLY14_Val         _UINT32_(0xE)                                        /* (PTC_CTRLD) 14 PTC clock cycle sampling delay  */
#define   PTC_CTRLD_SAMPDLY_DLY15_Val         _UINT32_(0xF)                                        /* (PTC_CTRLD) 15 PTC clock cycle sampling delay  */
#define PTC_CTRLD_SAMPDLY_OFF                 (PTC_CTRLD_SAMPDLY_OFF_Val << PTC_CTRLD_SAMPDLY_Pos) /* (PTC_CTRLD) No sampling delay Position */
#define PTC_CTRLD_SAMPDLY_DLY1                (PTC_CTRLD_SAMPDLY_DLY1_Val << PTC_CTRLD_SAMPDLY_Pos) /* (PTC_CTRLD) 1 PTC clock cycle sampling delay Position */
#define PTC_CTRLD_SAMPDLY_DLY2                (PTC_CTRLD_SAMPDLY_DLY2_Val << PTC_CTRLD_SAMPDLY_Pos) /* (PTC_CTRLD) 2 PTC clock cycle sampling delay Position */
#define PTC_CTRLD_SAMPDLY_DLY3                (PTC_CTRLD_SAMPDLY_DLY3_Val << PTC_CTRLD_SAMPDLY_Pos) /* (PTC_CTRLD) 3 PTC clock cycle sampling delay Position */
#define PTC_CTRLD_SAMPDLY_DLY4                (PTC_CTRLD_SAMPDLY_DLY4_Val << PTC_CTRLD_SAMPDLY_Pos) /* (PTC_CTRLD) 4 PTC clock cycle sampling delay Position */
#define PTC_CTRLD_SAMPDLY_DLY5                (PTC_CTRLD_SAMPDLY_DLY5_Val << PTC_CTRLD_SAMPDLY_Pos) /* (PTC_CTRLD) 5 PTC clock cycle sampling delay Position */
#define PTC_CTRLD_SAMPDLY_DLY6                (PTC_CTRLD_SAMPDLY_DLY6_Val << PTC_CTRLD_SAMPDLY_Pos) /* (PTC_CTRLD) 6 PTC clock cycle sampling delay Position */
#define PTC_CTRLD_SAMPDLY_DLY7                (PTC_CTRLD_SAMPDLY_DLY7_Val << PTC_CTRLD_SAMPDLY_Pos) /* (PTC_CTRLD) 7 PTC clock cycle sampling delay Position */
#define PTC_CTRLD_SAMPDLY_DLY8                (PTC_CTRLD_SAMPDLY_DLY8_Val << PTC_CTRLD_SAMPDLY_Pos) /* (PTC_CTRLD) 8 PTC clock cycle sampling delay Position */
#define PTC_CTRLD_SAMPDLY_DLY9                (PTC_CTRLD_SAMPDLY_DLY9_Val << PTC_CTRLD_SAMPDLY_Pos) /* (PTC_CTRLD) 9 PTC clock cycle sampling delay Position */
#define PTC_CTRLD_SAMPDLY_DLY10               (PTC_CTRLD_SAMPDLY_DLY10_Val << PTC_CTRLD_SAMPDLY_Pos) /* (PTC_CTRLD) 10 PTC clock cycle sampling delay Position */
#define PTC_CTRLD_SAMPDLY_DLY11               (PTC_CTRLD_SAMPDLY_DLY11_Val << PTC_CTRLD_SAMPDLY_Pos) /* (PTC_CTRLD) 11 PTC clock cycle sampling delay Position */
#define PTC_CTRLD_SAMPDLY_DLY12               (PTC_CTRLD_SAMPDLY_DLY12_Val << PTC_CTRLD_SAMPDLY_Pos) /* (PTC_CTRLD) 12 PTC clock cycle sampling delay Position */
#define PTC_CTRLD_SAMPDLY_DLY13               (PTC_CTRLD_SAMPDLY_DLY13_Val << PTC_CTRLD_SAMPDLY_Pos) /* (PTC_CTRLD) 13 PTC clock cycle sampling delay Position */
#define PTC_CTRLD_SAMPDLY_DLY14               (PTC_CTRLD_SAMPDLY_DLY14_Val << PTC_CTRLD_SAMPDLY_Pos) /* (PTC_CTRLD) 14 PTC clock cycle sampling delay Position */
#define PTC_CTRLD_SAMPDLY_DLY15               (PTC_CTRLD_SAMPDLY_DLY15_Val << PTC_CTRLD_SAMPDLY_Pos) /* (PTC_CTRLD) 15 PTC clock cycle sampling delay Position */
#define PTC_CTRLD_SDV_Pos                     _UINT32_(6)                                          /* (PTC_CTRLD) Sampling delay variation Position */
#define PTC_CTRLD_SDV_Msk                     (_UINT32_(0x3) << PTC_CTRLD_SDV_Pos)                 /* (PTC_CTRLD) Sampling delay variation Mask */
#define PTC_CTRLD_SDV(value)                  (PTC_CTRLD_SDV_Msk & (_UINT32_(value) << PTC_CTRLD_SDV_Pos)) /* Assignment of value for SDV in the PTC_CTRLD register */
#define   PTC_CTRLD_SDV_FIXED_Val             _UINT32_(0x0)                                        /* (PTC_CTRLD) Fixed sampling delay  */
#define   PTC_CTRLD_SDV_INC_Val               _UINT32_(0x1)                                        /* (PTC_CTRLD) Incremental delay  */
#define   PTC_CTRLD_SDV_LFSR_Val              _UINT32_(0x2)                                        /* (PTC_CTRLD) Sampling delay follows sequence iven by polynomial x4+x3+1  */
#define PTC_CTRLD_SDV_FIXED                   (PTC_CTRLD_SDV_FIXED_Val << PTC_CTRLD_SDV_Pos)       /* (PTC_CTRLD) Fixed sampling delay Position */
#define PTC_CTRLD_SDV_INC                     (PTC_CTRLD_SDV_INC_Val << PTC_CTRLD_SDV_Pos)         /* (PTC_CTRLD) Incremental delay Position */
#define PTC_CTRLD_SDV_LFSR                    (PTC_CTRLD_SDV_LFSR_Val << PTC_CTRLD_SDV_Pos)        /* (PTC_CTRLD) Sampling delay follows sequence iven by polynomial x4+x3+1 Position */
#define PTC_CTRLD_Msk                         _UINT32_(0x000000CF)                                 /* (PTC_CTRLD) Register Mask  */


/* -------- PTC_CTRLE : (PTC Offset: 0x10) (R/W 32) CTRLE -------- */
#define PTC_CTRLE_RESETVALUE                  _UINT32_(0x00)                                       /*  (PTC_CTRLE) CTRLE  Reset Value */

#define PTC_CTRLE_POLICC_Pos                  _UINT32_(0)                                          /* (PTC_CTRLE) Polarity of Internal Compensation Capacitor Position */
#define PTC_CTRLE_POLICC_Msk                  (_UINT32_(0x1) << PTC_CTRLE_POLICC_Pos)              /* (PTC_CTRLE) Polarity of Internal Compensation Capacitor Mask */
#define PTC_CTRLE_POLICC(value)               (PTC_CTRLE_POLICC_Msk & (_UINT32_(value) << PTC_CTRLE_POLICC_Pos)) /* Assignment of value for POLICC in the PTC_CTRLE register */
#define   PTC_CTRLE_POLICC_NORMAL_Val         _UINT32_(0x0)                                        /* (PTC_CTRLE) Normal Polarity  */
#define   PTC_CTRLE_POLICC_INVERTED_Val       _UINT32_(0x1)                                        /* (PTC_CTRLE) Inverted Polarity  */
#define PTC_CTRLE_POLICC_NORMAL               (PTC_CTRLE_POLICC_NORMAL_Val << PTC_CTRLE_POLICC_Pos) /* (PTC_CTRLE) Normal Polarity Position */
#define PTC_CTRLE_POLICC_INVERTED             (PTC_CTRLE_POLICC_INVERTED_Val << PTC_CTRLE_POLICC_Pos) /* (PTC_CTRLE) Inverted Polarity Position */
#define PTC_CTRLE_Msk                         _UINT32_(0x00000001)                                 /* (PTC_CTRLE) Register Mask  */


/* -------- PTC_DSCTRL : (PTC Offset: 0x18) (R/W 32) DSCTRL -------- */
#define PTC_DSCTRL_RESETVALUE                 _UINT32_(0x00)                                       /*  (PTC_DSCTRL) DSCTRL  Reset Value */

#define PTC_DSCTRL_CHARGEA_Pos                _UINT32_(0)                                          /* (PTC_DSCTRL) Driven shield Charge A Position */
#define PTC_DSCTRL_CHARGEA_Msk                (_UINT32_(0x1) << PTC_DSCTRL_CHARGEA_Pos)            /* (PTC_DSCTRL) Driven shield Charge A Mask */
#define PTC_DSCTRL_CHARGEA(value)             (PTC_DSCTRL_CHARGEA_Msk & (_UINT32_(value) << PTC_DSCTRL_CHARGEA_Pos)) /* Assignment of value for CHARGEA in the PTC_DSCTRL register */
#define PTC_DSCTRL_BALANCEA_Pos               _UINT32_(1)                                          /* (PTC_DSCTRL) Driven shield Balance A Position */
#define PTC_DSCTRL_BALANCEA_Msk               (_UINT32_(0x1) << PTC_DSCTRL_BALANCEA_Pos)           /* (PTC_DSCTRL) Driven shield Balance A Mask */
#define PTC_DSCTRL_BALANCEA(value)            (PTC_DSCTRL_BALANCEA_Msk & (_UINT32_(value) << PTC_DSCTRL_BALANCEA_Pos)) /* Assignment of value for BALANCEA in the PTC_DSCTRL register */
#define PTC_DSCTRL_INTGRA_Pos                 _UINT32_(2)                                          /* (PTC_DSCTRL) Driven shield Integrate A Position */
#define PTC_DSCTRL_INTGRA_Msk                 (_UINT32_(0x1) << PTC_DSCTRL_INTGRA_Pos)             /* (PTC_DSCTRL) Driven shield Integrate A Mask */
#define PTC_DSCTRL_INTGRA(value)              (PTC_DSCTRL_INTGRA_Msk & (_UINT32_(value) << PTC_DSCTRL_INTGRA_Pos)) /* Assignment of value for INTGRA in the PTC_DSCTRL register */
#define PTC_DSCTRL_CHARGEB_Pos                _UINT32_(4)                                          /* (PTC_DSCTRL) Driven shield Charge B Position */
#define PTC_DSCTRL_CHARGEB_Msk                (_UINT32_(0x1) << PTC_DSCTRL_CHARGEB_Pos)            /* (PTC_DSCTRL) Driven shield Charge B Mask */
#define PTC_DSCTRL_CHARGEB(value)             (PTC_DSCTRL_CHARGEB_Msk & (_UINT32_(value) << PTC_DSCTRL_CHARGEB_Pos)) /* Assignment of value for CHARGEB in the PTC_DSCTRL register */
#define PTC_DSCTRL_BALANCEB_Pos               _UINT32_(5)                                          /* (PTC_DSCTRL) Driven shield Balance B Position */
#define PTC_DSCTRL_BALANCEB_Msk               (_UINT32_(0x1) << PTC_DSCTRL_BALANCEB_Pos)           /* (PTC_DSCTRL) Driven shield Balance B Mask */
#define PTC_DSCTRL_BALANCEB(value)            (PTC_DSCTRL_BALANCEB_Msk & (_UINT32_(value) << PTC_DSCTRL_BALANCEB_Pos)) /* Assignment of value for BALANCEB in the PTC_DSCTRL register */
#define PTC_DSCTRL_INTGRB_Pos                 _UINT32_(6)                                          /* (PTC_DSCTRL) Driven shield Integrate B Position */
#define PTC_DSCTRL_INTGRB_Msk                 (_UINT32_(0x1) << PTC_DSCTRL_INTGRB_Pos)             /* (PTC_DSCTRL) Driven shield Integrate B Mask */
#define PTC_DSCTRL_INTGRB(value)              (PTC_DSCTRL_INTGRB_Msk & (_UINT32_(value) << PTC_DSCTRL_INTGRB_Pos)) /* Assignment of value for INTGRB in the PTC_DSCTRL register */
#define PTC_DSCTRL_Msk                        _UINT32_(0x00000077)                                 /* (PTC_DSCTRL) Register Mask  */


/* -------- PTC_PHLEN : (PTC Offset: 0x1C) (R/W 32) PHLEN -------- */
#define PTC_PHLEN_RESETVALUE                  _UINT32_(0x00)                                       /*  (PTC_PHLEN) PHLEN  Reset Value */

#define PTC_PHLEN_RSTLEN_Pos                  _UINT32_(0)                                          /* (PTC_PHLEN) Reset Length Position */
#define PTC_PHLEN_RSTLEN_Msk                  (_UINT32_(0xFF) << PTC_PHLEN_RSTLEN_Pos)             /* (PTC_PHLEN) Reset Length Mask */
#define PTC_PHLEN_RSTLEN(value)               (PTC_PHLEN_RSTLEN_Msk & (_UINT32_(value) << PTC_PHLEN_RSTLEN_Pos)) /* Assignment of value for RSTLEN in the PTC_PHLEN register */
#define PTC_PHLEN_BALLEN_Pos                  _UINT32_(8)                                          /* (PTC_PHLEN) Balance Length Position */
#define PTC_PHLEN_BALLEN_Msk                  (_UINT32_(0xFF) << PTC_PHLEN_BALLEN_Pos)             /* (PTC_PHLEN) Balance Length Mask */
#define PTC_PHLEN_BALLEN(value)               (PTC_PHLEN_BALLEN_Msk & (_UINT32_(value) << PTC_PHLEN_BALLEN_Pos)) /* Assignment of value for BALLEN in the PTC_PHLEN register */
#define PTC_PHLEN_INTGRLEN_Pos                _UINT32_(16)                                         /* (PTC_PHLEN) Integration Length Position */
#define PTC_PHLEN_INTGRLEN_Msk                (_UINT32_(0xFF) << PTC_PHLEN_INTGRLEN_Pos)           /* (PTC_PHLEN) Integration Length Mask */
#define PTC_PHLEN_INTGRLEN(value)             (PTC_PHLEN_INTGRLEN_Msk & (_UINT32_(value) << PTC_PHLEN_INTGRLEN_Pos)) /* Assignment of value for INTGRLEN in the PTC_PHLEN register */
#define PTC_PHLEN_SAMPLEN_Pos                 _UINT32_(24)                                         /* (PTC_PHLEN) Sampling Length Position */
#define PTC_PHLEN_SAMPLEN_Msk                 (_UINT32_(0xFF) << PTC_PHLEN_SAMPLEN_Pos)            /* (PTC_PHLEN) Sampling Length Mask */
#define PTC_PHLEN_SAMPLEN(value)              (PTC_PHLEN_SAMPLEN_Msk & (_UINT32_(value) << PTC_PHLEN_SAMPLEN_Pos)) /* Assignment of value for SAMPLEN in the PTC_PHLEN register */
#define PTC_PHLEN_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (PTC_PHLEN) Register Mask  */


