Microchip-MPLAB-Harmony/touch_apps/apps/t10_mutualcap_xpro_board/pic32cm_pl10_cnano/firmware/src/packs/PIC32CM6408PL10048_DFP/component/ptc.h
/* -------- PTC_SWTRIG : (PTC Offset: 0x20) (R/W 32) SWTRIG -------- */
#define PTC_SWTRIG_RESETVALUE                 _UINT32_(0x00)                                       /*  (PTC_SWTRIG) SWTRIG  Reset Value */

#define PTC_SWTRIG_Msk                        _UINT32_(0x00000000)                                 /* (PTC_SWTRIG) Register Mask  */


/* -------- PTC_SYNCBUSY : (PTC Offset: 0x24) (R/W 32) SYNCBUSY -------- */
#define PTC_SYNCBUSY_RESETVALUE               _UINT32_(0x00)                                       /*  (PTC_SYNCBUSY) SYNCBUSY  Reset Value */

#define PTC_SYNCBUSY_SWRST_Pos                _UINT32_(0)                                          /* (PTC_SYNCBUSY) Software reset busy bit Position */
#define PTC_SYNCBUSY_SWRST_Msk                (_UINT32_(0x1) << PTC_SYNCBUSY_SWRST_Pos)            /* (PTC_SYNCBUSY) Software reset busy bit Mask */
#define PTC_SYNCBUSY_SWRST(value)             (PTC_SYNCBUSY_SWRST_Msk & (_UINT32_(value) << PTC_SYNCBUSY_SWRST_Pos)) /* Assignment of value for SWRST in the PTC_SYNCBUSY register */
#define PTC_SYNCBUSY_Msk                      _UINT32_(0x00000001)                                 /* (PTC_SYNCBUSY) Register Mask  */


/* -------- PTC_BISTCTRL : (PTC Offset: 0x28) (R/W 32) BISTCTRL -------- */
#define PTC_BISTCTRL_RESETVALUE               _UINT32_(0x00)                                       /*  (PTC_BISTCTRL) BISTCTRL  Reset Value */

#define PTC_BISTCTRL_BEN_Pos                  _UINT32_(0)                                          /* (PTC_BISTCTRL) Bist Enable Position */
#define PTC_BISTCTRL_BEN_Msk                  (_UINT32_(0x1) << PTC_BISTCTRL_BEN_Pos)              /* (PTC_BISTCTRL) Bist Enable Mask */
#define PTC_BISTCTRL_BEN(value)               (PTC_BISTCTRL_BEN_Msk & (_UINT32_(value) << PTC_BISTCTRL_BEN_Pos)) /* Assignment of value for BEN in the PTC_BISTCTRL register */
#define PTC_BISTCTRL_BPOL_Pos                 _UINT32_(1)                                          /* (PTC_BISTCTRL) Bist Polarity Position */
#define PTC_BISTCTRL_BPOL_Msk                 (_UINT32_(0x1) << PTC_BISTCTRL_BPOL_Pos)             /* (PTC_BISTCTRL) Bist Polarity Mask */
#define PTC_BISTCTRL_BPOL(value)              (PTC_BISTCTRL_BPOL_Msk & (_UINT32_(value) << PTC_BISTCTRL_BPOL_Pos)) /* Assignment of value for BPOL in the PTC_BISTCTRL register */
#define PTC_BISTCTRL_BCAP0EN_Pos              _UINT32_(2)                                          /* (PTC_BISTCTRL) Bist Cap 0 Enable Position */
#define PTC_BISTCTRL_BCAP0EN_Msk              (_UINT32_(0x1) << PTC_BISTCTRL_BCAP0EN_Pos)          /* (PTC_BISTCTRL) Bist Cap 0 Enable Mask */
#define PTC_BISTCTRL_BCAP0EN(value)           (PTC_BISTCTRL_BCAP0EN_Msk & (_UINT32_(value) << PTC_BISTCTRL_BCAP0EN_Pos)) /* Assignment of value for BCAP0EN in the PTC_BISTCTRL register */
#define PTC_BISTCTRL_BCAP1EN_Pos              _UINT32_(3)                                          /* (PTC_BISTCTRL) Bist Cap 1 Enable Position */
#define PTC_BISTCTRL_BCAP1EN_Msk              (_UINT32_(0x1) << PTC_BISTCTRL_BCAP1EN_Pos)          /* (PTC_BISTCTRL) Bist Cap 1 Enable Mask */
#define PTC_BISTCTRL_BCAP1EN(value)           (PTC_BISTCTRL_BCAP1EN_Msk & (_UINT32_(value) << PTC_BISTCTRL_BCAP1EN_Pos)) /* Assignment of value for BCAP1EN in the PTC_BISTCTRL register */
#define PTC_BISTCTRL_BCAP2EN_Pos              _UINT32_(4)                                          /* (PTC_BISTCTRL) Bist Cap 2 Enable Position */
#define PTC_BISTCTRL_BCAP2EN_Msk              (_UINT32_(0x1) << PTC_BISTCTRL_BCAP2EN_Pos)          /* (PTC_BISTCTRL) Bist Cap 2 Enable Mask */
#define PTC_BISTCTRL_BCAP2EN(value)           (PTC_BISTCTRL_BCAP2EN_Msk & (_UINT32_(value) << PTC_BISTCTRL_BCAP2EN_Pos)) /* Assignment of value for BCAP2EN in the PTC_BISTCTRL register */
#define PTC_BISTCTRL_Msk                      _UINT32_(0x0000001F)                                 /* (PTC_BISTCTRL) Register Mask  */


/* -------- PTC_RCTUNE : (PTC Offset: 0x2C) (R/W 32) RCTUNE -------- */
#define PTC_RCTUNE_RESETVALUE                 _UINT32_(0x00)                                       /*  (PTC_RCTUNE) RCTUNE  Reset Value */

#define PTC_RCTUNE_CCAPC_Pos                  _UINT32_(0)                                          /* (PTC_RCTUNE) Compensation Capacitor Coarse Position */
#define PTC_RCTUNE_CCAPC_Msk                  (_UINT32_(0x3F) << PTC_RCTUNE_CCAPC_Pos)             /* (PTC_RCTUNE) Compensation Capacitor Coarse Mask */
#define PTC_RCTUNE_CCAPC(value)               (PTC_RCTUNE_CCAPC_Msk & (_UINT32_(value) << PTC_RCTUNE_CCAPC_Pos)) /* Assignment of value for CCAPC in the PTC_RCTUNE register */
#define PTC_RCTUNE_CCAPF_Pos                  _UINT32_(8)                                          /* (PTC_RCTUNE) Compensation Capacitor Fine Position */
#define PTC_RCTUNE_CCAPF_Msk                  (_UINT32_(0xF) << PTC_RCTUNE_CCAPF_Pos)              /* (PTC_RCTUNE) Compensation Capacitor Fine Mask */
#define PTC_RCTUNE_CCAPF(value)               (PTC_RCTUNE_CCAPF_Msk & (_UINT32_(value) << PTC_RCTUNE_CCAPF_Pos)) /* Assignment of value for CCAPF in the PTC_RCTUNE register */
#define PTC_RCTUNE_ICAP_Pos                   _UINT32_(16)                                         /* (PTC_RCTUNE) Integration Capacitor Position */
#define PTC_RCTUNE_ICAP_Msk                   (_UINT32_(0x3) << PTC_RCTUNE_ICAP_Pos)               /* (PTC_RCTUNE) Integration Capacitor Mask */
#define PTC_RCTUNE_ICAP(value)                (PTC_RCTUNE_ICAP_Msk & (_UINT32_(value) << PTC_RCTUNE_ICAP_Pos)) /* Assignment of value for ICAP in the PTC_RCTUNE register */
#define   PTC_RCTUNE_ICAP_8FF_Val             _UINT32_(0x0)                                        /* (PTC_RCTUNE) 8 fF Integration Cap  */
#define   PTC_RCTUNE_ICAP_16FF_Val            _UINT32_(0x1)                                        /* (PTC_RCTUNE) 16 fF Integration Cap  */
#define   PTC_RCTUNE_ICAP_24FF_Val            _UINT32_(0x2)                                        /* (PTC_RCTUNE) 24 fF Integration Cap  */
#define   PTC_RCTUNE_ICAP_32FF_Val            _UINT32_(0x3)                                        /* (PTC_RCTUNE) 32 fF Integration Cap  */
#define PTC_RCTUNE_ICAP_8FF                   (PTC_RCTUNE_ICAP_8FF_Val << PTC_RCTUNE_ICAP_Pos)     /* (PTC_RCTUNE) 8 fF Integration Cap Position */
#define PTC_RCTUNE_ICAP_16FF                  (PTC_RCTUNE_ICAP_16FF_Val << PTC_RCTUNE_ICAP_Pos)    /* (PTC_RCTUNE) 16 fF Integration Cap Position */
#define PTC_RCTUNE_ICAP_24FF                  (PTC_RCTUNE_ICAP_24FF_Val << PTC_RCTUNE_ICAP_Pos)    /* (PTC_RCTUNE) 24 fF Integration Cap Position */
#define PTC_RCTUNE_ICAP_32FF                  (PTC_RCTUNE_ICAP_32FF_Val << PTC_RCTUNE_ICAP_Pos)    /* (PTC_RCTUNE) 32 fF Integration Cap Position */
#define PTC_RCTUNE_EXTIC_Pos                  _UINT32_(22)                                         /* (PTC_RCTUNE) External Integration Cap Position */
#define PTC_RCTUNE_EXTIC_Msk                  (_UINT32_(0x3) << PTC_RCTUNE_EXTIC_Pos)              /* (PTC_RCTUNE) External Integration Cap Mask */
#define PTC_RCTUNE_EXTIC(value)               (PTC_RCTUNE_EXTIC_Msk & (_UINT32_(value) << PTC_RCTUNE_EXTIC_Pos)) /* Assignment of value for EXTIC in the PTC_RCTUNE register */
#define PTC_RCTUNE_SERRES_Pos                 _UINT32_(24)                                         /* (PTC_RCTUNE) Series Resistor Position */
#define PTC_RCTUNE_SERRES_Msk                 (_UINT32_(0x7) << PTC_RCTUNE_SERRES_Pos)             /* (PTC_RCTUNE) Series Resistor Mask */
#define PTC_RCTUNE_SERRES(value)              (PTC_RCTUNE_SERRES_Msk & (_UINT32_(value) << PTC_RCTUNE_SERRES_Pos)) /* Assignment of value for SERRES in the PTC_RCTUNE register */
#define   PTC_RCTUNE_SERRES_OFF_Val           _UINT32_(0x0)                                        /* (PTC_RCTUNE) No Resistor  */
#define   PTC_RCTUNE_SERRES_20K_Val           _UINT32_(0x1)                                        /* (PTC_RCTUNE) 20 k  */
#define   PTC_RCTUNE_SERRES_50K_Val           _UINT32_(0x2)                                        /* (PTC_RCTUNE) 50 k  */
#define   PTC_RCTUNE_SERRES_70K_Val           _UINT32_(0x3)                                        /* (PTC_RCTUNE) 70 k  */
#define   PTC_RCTUNE_SERRES_80K_Val           _UINT32_(0x4)                                        /* (PTC_RCTUNE) 80 k  */
#define   PTC_RCTUNE_SERRES_100K_Val          _UINT32_(0x5)                                        /* (PTC_RCTUNE) 100 k  */
#define   PTC_RCTUNE_SERRES_120K_Val          _UINT32_(0x6)                                        /* (PTC_RCTUNE) 120 k  */
#define   PTC_RCTUNE_SERRES_200K_Val          _UINT32_(0x7)                                        /* (PTC_RCTUNE) 200 k  */
#define PTC_RCTUNE_SERRES_OFF                 (PTC_RCTUNE_SERRES_OFF_Val << PTC_RCTUNE_SERRES_Pos) /* (PTC_RCTUNE) No Resistor Position */
#define PTC_RCTUNE_SERRES_20K                 (PTC_RCTUNE_SERRES_20K_Val << PTC_RCTUNE_SERRES_Pos) /* (PTC_RCTUNE) 20 k Position */
#define PTC_RCTUNE_SERRES_50K                 (PTC_RCTUNE_SERRES_50K_Val << PTC_RCTUNE_SERRES_Pos) /* (PTC_RCTUNE) 50 k Position */
#define PTC_RCTUNE_SERRES_70K                 (PTC_RCTUNE_SERRES_70K_Val << PTC_RCTUNE_SERRES_Pos) /* (PTC_RCTUNE) 70 k Position */
#define PTC_RCTUNE_SERRES_80K                 (PTC_RCTUNE_SERRES_80K_Val << PTC_RCTUNE_SERRES_Pos) /* (PTC_RCTUNE) 80 k Position */
#define PTC_RCTUNE_SERRES_100K                (PTC_RCTUNE_SERRES_100K_Val << PTC_RCTUNE_SERRES_Pos) /* (PTC_RCTUNE) 100 k Position */
#define PTC_RCTUNE_SERRES_120K                (PTC_RCTUNE_SERRES_120K_Val << PTC_RCTUNE_SERRES_Pos) /* (PTC_RCTUNE) 120 k Position */
#define PTC_RCTUNE_SERRES_200K                (PTC_RCTUNE_SERRES_200K_Val << PTC_RCTUNE_SERRES_Pos) /* (PTC_RCTUNE) 200 k Position */
#define PTC_RCTUNE_CCRES_Pos                  _UINT32_(28)                                         /* (PTC_RCTUNE) Comp Cap Resistor Position */
#define PTC_RCTUNE_CCRES_Msk                  (_UINT32_(0x7) << PTC_RCTUNE_CCRES_Pos)              /* (PTC_RCTUNE) Comp Cap Resistor Mask */
#define PTC_RCTUNE_CCRES(value)               (PTC_RCTUNE_CCRES_Msk & (_UINT32_(value) << PTC_RCTUNE_CCRES_Pos)) /* Assignment of value for CCRES in the PTC_RCTUNE register */
#define   PTC_RCTUNE_CCRES_OFF_Val            _UINT32_(0x0)                                        /* (PTC_RCTUNE) No Resistor  */
#define   PTC_RCTUNE_CCRES_20K_Val            _UINT32_(0x1)                                        /* (PTC_RCTUNE) 20 k  */
#define   PTC_RCTUNE_CCRES_50K_Val            _UINT32_(0x2)                                        /* (PTC_RCTUNE) 50 k  */
#define   PTC_RCTUNE_CCRES_70K_Val            _UINT32_(0x3)                                        /* (PTC_RCTUNE) 70 k  */
#define   PTC_RCTUNE_CCRES_80K_Val            _UINT32_(0x4)                                        /* (PTC_RCTUNE) 80 k  */
#define   PTC_RCTUNE_CCRES_100K_Val           _UINT32_(0x5)                                        /* (PTC_RCTUNE) 100 k  */
#define   PTC_RCTUNE_CCRES_120K_Val           _UINT32_(0x6)                                        /* (PTC_RCTUNE) 120 k  */
#define   PTC_RCTUNE_CCRES_200K_Val           _UINT32_(0x7)                                        /* (PTC_RCTUNE) 200 k  */
#define PTC_RCTUNE_CCRES_OFF                  (PTC_RCTUNE_CCRES_OFF_Val << PTC_RCTUNE_CCRES_Pos)   /* (PTC_RCTUNE) No Resistor Position */
#define PTC_RCTUNE_CCRES_20K                  (PTC_RCTUNE_CCRES_20K_Val << PTC_RCTUNE_CCRES_Pos)   /* (PTC_RCTUNE) 20 k Position */
#define PTC_RCTUNE_CCRES_50K                  (PTC_RCTUNE_CCRES_50K_Val << PTC_RCTUNE_CCRES_Pos)   /* (PTC_RCTUNE) 50 k Position */
#define PTC_RCTUNE_CCRES_70K                  (PTC_RCTUNE_CCRES_70K_Val << PTC_RCTUNE_CCRES_Pos)   /* (PTC_RCTUNE) 70 k Position */
#define PTC_RCTUNE_CCRES_80K                  (PTC_RCTUNE_CCRES_80K_Val << PTC_RCTUNE_CCRES_Pos)   /* (PTC_RCTUNE) 80 k Position */
#define PTC_RCTUNE_CCRES_100K                 (PTC_RCTUNE_CCRES_100K_Val << PTC_RCTUNE_CCRES_Pos)  /* (PTC_RCTUNE) 100 k Position */
#define PTC_RCTUNE_CCRES_120K                 (PTC_RCTUNE_CCRES_120K_Val << PTC_RCTUNE_CCRES_Pos)  /* (PTC_RCTUNE) 120 k Position */
#define PTC_RCTUNE_CCRES_200K                 (PTC_RCTUNE_CCRES_200K_Val << PTC_RCTUNE_CCRES_Pos)  /* (PTC_RCTUNE) 200 k Position */
#define PTC_RCTUNE_Msk                        _UINT32_(0x77C30F3F)                                 /* (PTC_RCTUNE) Register Mask  */


