Microchip-MPLAB-Harmony/touch_apps/apps/t10_mutualcap_xpro_board/pic32cm_pl10_cnano/firmware/src/packs/PIC32CM6408PL10048_DFP/component/ptc.h
/* -------- PTC_XSEL0 : (PTC Offset: 0x30) (R/W 32) XSEL0 -------- */
#define PTC_XSEL0_RESETVALUE                  _UINT32_(0x00)                                       /*  (PTC_XSEL0) XSEL0  Reset Value */

#define PTC_XSEL0_Msk                         _UINT32_(0x00000000)                                 /* (PTC_XSEL0) Register Mask  */


/* -------- PTC_XSEL1 : (PTC Offset: 0x34) (R/W 32) XSEL1 -------- */
#define PTC_XSEL1_RESETVALUE                  _UINT32_(0x00)                                       /*  (PTC_XSEL1) XSEL1  Reset Value */

#define PTC_XSEL1_Msk                         _UINT32_(0x00000000)                                 /* (PTC_XSEL1) Register Mask  */


/* -------- PTC_YSEL0 : (PTC Offset: 0x38) (R/W 32) YSEL0 -------- */
#define PTC_YSEL0_RESETVALUE                  _UINT32_(0x00)                                       /*  (PTC_YSEL0) YSEL0  Reset Value */

#define PTC_YSEL0_Msk                         _UINT32_(0x00000000)                                 /* (PTC_YSEL0) Register Mask  */


/* -------- PTC_YSEL1 : (PTC Offset: 0x3C) (R/W 32) YSEL1 -------- */
#define PTC_YSEL1_RESETVALUE                  _UINT32_(0x00)                                       /*  (PTC_YSEL1) YSEL1  Reset Value */

#define PTC_YSEL1_Msk                         _UINT32_(0x00000000)                                 /* (PTC_YSEL1) Register Mask  */


/* -------- PTC_PSEL0 : (PTC Offset: 0x40) (R/W 32) PSEL0 -------- */
#define PTC_PSEL0_RESETVALUE                  _UINT32_(0x00)                                       /*  (PTC_PSEL0) PSEL0  Reset Value */

#define PTC_PSEL0_Msk                         _UINT32_(0x00000000)                                 /* (PTC_PSEL0) Register Mask  */


/* -------- PTC_PSEL1 : (PTC Offset: 0x44) (R/W 32) PSEL1 -------- */
#define PTC_PSEL1_RESETVALUE                  _UINT32_(0x00)                                       /*  (PTC_PSEL1) PSEL1  Reset Value */

#define PTC_PSEL1_Msk                         _UINT32_(0x00000000)                                 /* (PTC_PSEL1) Register Mask  */


/* -------- PTC_WPCTRL : (PTC Offset: 0x4C) (R/W 32) WPCTRL -------- */
#define PTC_WPCTRL_RESETVALUE                 _UINT32_(0x00)                                       /*  (PTC_WPCTRL) WPCTRL  Reset Value */

#define PTC_WPCTRL_WPEN_Pos                   _UINT32_(0)                                          /* (PTC_WPCTRL) Write Protection Enable Position */
#define PTC_WPCTRL_WPEN_Msk                   (_UINT32_(0x1) << PTC_WPCTRL_WPEN_Pos)               /* (PTC_WPCTRL) Write Protection Enable Mask */
#define PTC_WPCTRL_WPEN(value)                (PTC_WPCTRL_WPEN_Msk & (_UINT32_(value) << PTC_WPCTRL_WPEN_Pos)) /* Assignment of value for WPEN in the PTC_WPCTRL register */
#define PTC_WPCTRL_WPLCK_Pos                  _UINT32_(1)                                          /* (PTC_WPCTRL) WPCTRL Write Lock Position */
#define PTC_WPCTRL_WPLCK_Msk                  (_UINT32_(0x1) << PTC_WPCTRL_WPLCK_Pos)              /* (PTC_WPCTRL) WPCTRL Write Lock Mask */
#define PTC_WPCTRL_WPLCK(value)               (PTC_WPCTRL_WPLCK_Msk & (_UINT32_(value) << PTC_WPCTRL_WPLCK_Pos)) /* Assignment of value for WPLCK in the PTC_WPCTRL register */
#define PTC_WPCTRL_WPKEY_Pos                  _UINT32_(8)                                          /* (PTC_WPCTRL) Write Protection Key Position */
#define PTC_WPCTRL_WPKEY_Msk                  (_UINT32_(0xFFFFFF) << PTC_WPCTRL_WPKEY_Pos)         /* (PTC_WPCTRL) Write Protection Key Mask */
#define PTC_WPCTRL_WPKEY(value)               (PTC_WPCTRL_WPKEY_Msk & (_UINT32_(value) << PTC_WPCTRL_WPKEY_Pos)) /* Assignment of value for WPKEY in the PTC_WPCTRL register */
#define PTC_WPCTRL_Msk                        _UINT32_(0xFFFFFF03)                                 /* (PTC_WPCTRL) Register Mask  */


/* PTC register offsets definitions */
#define PTC_CTRLA_REG_OFST             _UINT32_(0x00)      /* (PTC_CTRLA) CTRLA Offset */
#define PTC_CTRLB_REG_OFST             _UINT32_(0x04)      /* (PTC_CTRLB) CTRLB Offset */
#define PTC_CTRLC_REG_OFST             _UINT32_(0x08)      /* (PTC_CTRLC) CTRLC Offset */
#define PTC_CTRLD_REG_OFST             _UINT32_(0x0C)      /* (PTC_CTRLD) CTRLD Offset */
#define PTC_CTRLE_REG_OFST             _UINT32_(0x10)      /* (PTC_CTRLE) CTRLE Offset */
#define PTC_DSCTRL_REG_OFST            _UINT32_(0x18)      /* (PTC_DSCTRL) DSCTRL Offset */
#define PTC_PHLEN_REG_OFST             _UINT32_(0x1C)      /* (PTC_PHLEN) PHLEN Offset */
#define PTC_SWTRIG_REG_OFST            _UINT32_(0x20)      /* (PTC_SWTRIG) SWTRIG Offset */
#define PTC_SYNCBUSY_REG_OFST          _UINT32_(0x24)      /* (PTC_SYNCBUSY) SYNCBUSY Offset */
#define PTC_BISTCTRL_REG_OFST          _UINT32_(0x28)      /* (PTC_BISTCTRL) BISTCTRL Offset */
#define PTC_RCTUNE_REG_OFST            _UINT32_(0x2C)      /* (PTC_RCTUNE) RCTUNE Offset */
#define PTC_XSEL0_REG_OFST             _UINT32_(0x30)      /* (PTC_XSEL0) XSEL0 Offset */
#define PTC_XSEL1_REG_OFST             _UINT32_(0x34)      /* (PTC_XSEL1) XSEL1 Offset */
#define PTC_YSEL0_REG_OFST             _UINT32_(0x38)      /* (PTC_YSEL0) YSEL0 Offset */
#define PTC_YSEL1_REG_OFST             _UINT32_(0x3C)      /* (PTC_YSEL1) YSEL1 Offset */
#define PTC_PSEL0_REG_OFST             _UINT32_(0x40)      /* (PTC_PSEL0) PSEL0 Offset */
#define PTC_PSEL1_REG_OFST             _UINT32_(0x44)      /* (PTC_PSEL1) PSEL1 Offset */
#define PTC_WPCTRL_REG_OFST            _UINT32_(0x4C)      /* (PTC_WPCTRL) WPCTRL Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* PTC register API structure */
typedef struct
{  /* Periphial Touch Controller */
  __IO  uint32_t                       PTC_CTRLA;          /* Offset: 0x00 (R/W  32) CTRLA */
  __IO  uint32_t                       PTC_CTRLB;          /* Offset: 0x04 (R/W  32) CTRLB */
  __IO  uint32_t                       PTC_CTRLC;          /* Offset: 0x08 (R/W  32) CTRLC */
  __IO  uint32_t                       PTC_CTRLD;          /* Offset: 0x0C (R/W  32) CTRLD */
  __IO  uint32_t                       PTC_CTRLE;          /* Offset: 0x10 (R/W  32) CTRLE */
  __I   uint8_t                        Reserved1[0x04];
  __IO  uint32_t                       PTC_DSCTRL;         /* Offset: 0x18 (R/W  32) DSCTRL */
  __IO  uint32_t                       PTC_PHLEN;          /* Offset: 0x1C (R/W  32) PHLEN */
  __IO  uint32_t                       PTC_SWTRIG;         /* Offset: 0x20 (R/W  32) SWTRIG */
  __IO  uint32_t                       PTC_SYNCBUSY;       /* Offset: 0x24 (R/W  32) SYNCBUSY */
  __IO  uint32_t                       PTC_BISTCTRL;       /* Offset: 0x28 (R/W  32) BISTCTRL */
  __IO  uint32_t                       PTC_RCTUNE;         /* Offset: 0x2C (R/W  32) RCTUNE */
  __IO  uint32_t                       PTC_XSEL0;          /* Offset: 0x30 (R/W  32) XSEL0 */
  __IO  uint32_t                       PTC_XSEL1;          /* Offset: 0x34 (R/W  32) XSEL1 */
  __IO  uint32_t                       PTC_YSEL0;          /* Offset: 0x38 (R/W  32) YSEL0 */
  __IO  uint32_t                       PTC_YSEL1;          /* Offset: 0x3C (R/W  32) YSEL1 */
  __IO  uint32_t                       PTC_PSEL0;          /* Offset: 0x40 (R/W  32) PSEL0 */
  __IO  uint32_t                       PTC_PSEL1;          /* Offset: 0x44 (R/W  32) PSEL1 */
  __I   uint8_t                        Reserved2[0x04];
  __IO  uint32_t                       PTC_WPCTRL;         /* Offset: 0x4C (R/W  32) WPCTRL */
} ptc_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CMPL10_PTC_COMPONENT_H_ */
